Catalogs/Серверы_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Серверы_ат</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лезвие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатеринскаяПлата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МатеринскиеПлаты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>HyperThreading</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виртуализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВиртуализацииСерверов_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hostname</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шлюз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВыделенныеIP_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Чужой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойIP</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВыделенныеIP_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДляНас</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>CPU_ат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Процессор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CPU_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RAM</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МодулиПамяти_ат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МодулиПамяти_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>HDD_ат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>HDD_ат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.HDD_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Raid</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыRAID_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СХД_ат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СХД_ат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СХД_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>IPv4</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IP</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВыделенныеIP_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DNS_servers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DNS</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВыделенныеIP_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Wins_servers</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>WINS</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВыделенныеIP_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>DNS_суффиксы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>DNS_суффикс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.DNS_суффиксы_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Interfaces_</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Interface</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СетевыеИнтерфейсы_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДополнительныеРеквизитыОрганизаций_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ДополнительныеРеквизитыОрганизаций_ат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Серверы_ат/Forms/ФормаСпискаИВыбора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ХАК до создания аренды. Показывать и наши серваки .
	Если Параметры.Отбор.Количество() > 0 Тогда
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		
		Если Параметры.Отбор.Свойство("КонтрагентВладелец") Тогда
			
			КонтрагентыВладельцы = КонтрагентыВладельцы();
			КонтрагентыВладельцы.Добавить(Параметры.Отбор.КонтрагентВладелец);
			
			Параметры.Отбор.КонтрагентВладелец = КонтрагентыВладельцы;
			
		КонецЕсли;
		
	Иначе
		
		Элементы.Список.Отображение = ОтображениеТаблицы.Дерево;
		
	КонецЕсли;
	
	УправляемыеФормы_Сервер_ат.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("ТипыРолейСерверов") Тогда
		
		Список.Параметры.УстановитьЗначениеПараметра("ТипыРолейСерверов", Параметры.ТипыРолейСерверов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправляемыеФормы_Клиент_ат.ПриОткрытии(ЭтаФорма, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	УправляемыеФормы_Клиент_ат.ПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка, ЗавершениеРаботы, ТекстПредупреждения);
	
КонецПроцедуры

#КонецОбласти 

#Область УниверсальныеОбработчикиДействий

&НаКлиенте
Процедура ОбработчикУниверсальныхДействий(Команда)
	
	УправляемыеФормы_Клиент_ат.ДополнительныеДействияФормы(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаСервере
Функция   ОбработчикУниверсальныхДействий_Сервер(Элемент) Экспорт
	
	Возврат УправляемыеФормы_Сервер_ат.ДополнительныеДействияФормы(ЭтаФорма, Команды[Элемент.Имя]);
	
КонецФункции

#КонецОбласти

&НаСервере
Функция   КонтрагентыВладельцы()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыОрганизаций_ат.Контрагент
	|ИЗ
	|	РегистрСведений.ДополнительныеРеквизитыОрганизаций_ат КАК ДополнительныеРеквизитыОрганизаций_ат
	|ГДЕ
	|	НЕ ДополнительныеРеквизитыОрганизаций_ат.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты_ат.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Контрагент");
	
КонецФункции
